src/toir_cf/src/DataProcessors/торо_ВыборРемонтаИзПланГрафика/торо_ВыборРемонтаИзПланГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ВыборРемонтаИзПланГрафика</name>
  <attributes>
    <name>ПланГрафикРемонта</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>АктОВыполненииЭтапаРабот</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/toir_cf/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПланГрафикРемонта</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитаноНаВерсииППР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.проф_НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ЦепочкиРемонта</types>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЦепочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перенесенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоНормативу</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержитВыходные</name>
      <comment>Добавлено под нужды проектов, потому по умолчанию скрыто</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/DataProcessors/торо_ВыборРемонтаИзПланГрафика/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("СсылкаНаППР") И ЭтаФорма.Параметры.СсылкаНаППР <> Документы.торо_ПланГрафикРемонта.ПустаяСсылка() Тогда
	
		Объект.ПланГрафикРемонта = ЭтаФорма.Параметры.СсылкаНаППР;
		
		Элементы.Группа1.ТекущаяСтраница = Элементы.РемонтыППРДляВыбора;
		
		УстановитьЗначенияПараметровДинамическихСписков();
		
		
		
		
	ИначеЕсли ЭтаФорма.Параметры.Свойство("СсылкаНаАкт") И ЭтаФорма.Параметры.СсылкаНаАкт <> Документы.торо_АктОВыполненииЭтапаРабот.ПустаяСсылка() Тогда
		
		Объект.АктОВыполненииЭтапаРабот = ЭтаФорма.Параметры.СсылкаНаАкт;
		
		Элементы.АктОВыполненииЭтапаРабот.Заголовок = Строка(Объект.АктОВыполненииЭтапаРабот);
		
		Контрагент = ЭтаФорма.Параметры.Контрагент;
		
		Элементы.Группа1.ТекущаяСтраница = Элементы.РемонтыДляВыбораАкт;
		
		УстановитьЗначенияПараметровДинамическихСписков();
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = НСтр("ru='Выбор ремонта из акта'");
	Иначе	
		
		Отказ = Истина;
				
	КонецЕсли; 
	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбъектовРемонта
&НаКлиенте
Процедура СписокОбъектовРемонтаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Группа1.ТекущаяСтраница = Элементы.РемонтыППРДляВыбора Тогда
		РемонтыИЗППР.Отбор.Элементы.Очистить();
		ЭлементОтбора = РемонтыИЗППР.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектРемонта");
		ЭлементОтбора.ПравоеЗначение = Элементы.СписокОбъектовРемонта.ТекущиеДанные.ОбъектРемонта;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтыИЗППР
&НаКлиенте
Процедура РемонтыИЗППРВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НайдСтроки = ВыбранныеРемонтыТаблица.НайтиСтроки(Новый Структура("ID_Ремонта", Элемент.ТекущиеДанные.ID_Ремонта));
	
	Если НайдСтроки.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Данный вид ремонта уже добален.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		НС = ВыбранныеРемонтыТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Элемент.ТекущиеДанные);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтыИзАкта
&НаКлиенте
Процедура РемонтыИзАктаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	НайдСтроки = ВыбранныеРемонтыТаблица.НайтиСтроки(Новый Структура("ID_Ремонта", Элемент.ТекущиеДанные.ID_Ремонта));
	
	Если НайдСтроки.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Данный вид ремонта уже добален.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		НС = ВыбранныеРемонтыТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Элемент.ТекущиеДанные);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыборе(ПолучитьТаблицуМассивом());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере 
Процедура УстановитьЗначенияПараметровДинамическихСписков()
	
	СписокОбъектовРемонта.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.ПланГрафикРемонта);
	РемонтыИЗППР.Параметры.УстановитьЗначениеПараметра("Ссылка"         , Объект.ПланГрафикРемонта);
	РемонтыИзАкта.Параметры.УстановитьЗначениеПараметра("Ссылка"        , Объект.АктОВыполненииЭтапаРабот);
	РемонтыИзАкта.Параметры.УстановитьЗначениеПараметра("Контрагент"    , Контрагент);	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТаблицуМассивом()

	Массив = Новый Массив;
		
	Для Каждого Строка ИЗ ВыбранныеРемонтыТаблица Цикл
	
		СтруктураДанныхСтроки = Новый Структура;
		
		СтруктураДанныхСтроки.Вставить("ID"                , Строка.ID_Ремонта);
		СтруктураДанныхСтроки.Вставить("ВидРемонтныхРабот" , Строка.ВидРемонта);
		СтруктураДанныхСтроки.Вставить("ДатаНач"           , Строка.ДатаНачала);
		СтруктураДанныхСтроки.Вставить("ДатаКон"           , Строка.ДатаОкончания);
		СтруктураДанныхСтроки.Вставить("ОбъектРемонта"     , Строка.ОбъектРемонта);
		
		Если ЗначениеЗаполнено(Объект.ПланГрафикРемонта) Тогда
			
			СтруктураДанныхСтроки.Вставить("СуммаРемонта"      , Строка.СуммаРемонта);
		
		КонецЕсли; 

		Массив.Добавить(СтруктураДанныхСтроки);
		
	КонецЦикла; 

	Возврат Массив;
	
КонецФункции 

#КонецОбласти
